.cf.xml/DataProcessors/обм_ИсходящиеСообщения_СозданиеАдресацияОтправка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>обм_ИсходящиеСообщения_СозданиеАдресацияОтправка</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

.cf.xml/InformationRegisters/обм_ОтправленныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>обм_ОтправленныеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФлагОшибкиОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсходящееСообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.обм_ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбработчикОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

.cf.xml/DataProcessors/обм_ИсходящиеСообщения_СозданиеАдресацияОтправка/Ext/ObjectModule.bsl
Перем	мОшибки;

#Область ПрограммныйИнтерфейс

Функция ЕстьОшибки() Экспорт
	
	Возврат мОшибки.Количество() > 0;
	
КонецФункции

Функция ИсходящееСообщение_Отправить(пИсходящееСообщение, пУзел, пОбработчик = Неопределено) Экспорт
	
	интерфейс = Обработки.обм_ИсходящиеСообщения_СозданиеАдресацияОтправка_ПереопределяемыйИнтерфейс.Создать();
	реализацииИнтерфейса = Новый Массив;
	Если пОбработчик = Неопределено Тогда
		реализацииИнтерфейса = общ.Интерфейс_НайтиРеализации(интерфейс);
		
	ИначеЕсли ТипЗнч(пОбработчик) = Тип("СправочникСсылка.общ_Обработчики") Тогда
		обработчикОдиночка = Справочники.общ_Обработчики.ОбработчикОдиночка(пОбработчик);
		реализацииИнтерфейса.Добавить(обработчикОдиночка);
		
	// Иначе будем считать что это объект внешней обработки, без проверок
	Иначе
		реализацииИнтерфейса.Добавить(пОбработчик);
		
	КонецЕсли;
	
	Для Каждого обработчик Из реализацииИнтерфейса Цикл
		общ.Интерфейс_УстановитьРеализацию(интерфейс, обработчик);
		
		флагОшибкиОтправки = Ложь;
		Попытка
			интерфейс.ИсходящееСообщение_Отправить(пИсходящееСообщение, пУзел);
			
		Исключение
			имяСобытия = обм.ИмяСобытияЖурналаРегистрации("ИсходящиеСообщения_Отправить");
			инфоОшибки = ИнформацияОбОшибке();
			
			ссылкиДанных = Новый Массив;
			обработчикСсылка = Справочники.общ_Обработчики.НайтиСсылку(обработчик);
			ссылкиДанных.Добавить(обработчикСсылка);
			
			общ.Ошибка_ВЖурналРегистрации(имяСобытия, инфоОшибки, ссылкиДанных);

			флагОшибкиОтправки = Истина;
			мОшибки.Добавить(инфоОшибки);
			
		КонецПопытки;
		
		записьОбОтправке = РегистрыСведений.обм_ОтправленныеСообщения.СоздатьМенеджерЗаписи();
		записьОбОтправке.ИсходящееСообщение = пИсходящееСообщение;
		записьОбОтправке.ОбработчикОтправки = Справочники.общ_Обработчики.НайтиСсылку(обработчик);
		записьОбОтправке.ДатаОтправки = ТекущаяДатаСеанса();
		записьОбОтправке.ФлагОшибкиОтправки = флагОшибкиОтправки;
		записьОбОтправке.Записать();

	КонецЦикла;
	обработчик = Неопределено

КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()

	мОшибки = Новый Массив;

КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

Инициализировать();
